Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПомещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодразделения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПодразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипПомещения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Режимное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРежимное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Подразделения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// В модуле формы элемента справочника "Подразделения"

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    // Проверяем, создается ли новый элемент или открывается существующий
    Если Объект.Ссылка.Пустая() Тогда
        // Если элемент новый, можно заполнить родителя по умолчанию
        ЗаполнитьРодителяПоУмолчанию();
    КонецЕсли;
    
    // Заполняем поля на основе родителя
    ЗаполнитьДанныеПоРодителю();
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
    // При изменении родителя обновляем данные на сервере
    ЗаполнитьДанныеПоРодителю();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРодителяПоУмолчанию()
    // Находим родительскую группу по умолчанию, например, "Головной офис"
    РодительскаяГруппа = Справочники.Подразделения.НайтиПоНаименованию("Головной офис", Истина);
    Если НЕ РодительскаяГруппа.Пустая() Тогда
        Объект.Родитель = РодительскаяГруппа;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоРодителю()
    // Проверяем, задан ли родитель
    Если НЕ Объект.Родитель.Пустая() Тогда
        // Заполняем данные на основе родителя
        Если Объект.Родитель.Наименование = "Головной офис" Тогда
            Объект.Адрес = "Корпус 10, этаж 1, ул. Новозаводская, д. 18"; // Пример адреса
            Объект.ТипПомещения = Перечисления.ТипПомещения.Нережимное;
            Объект.КонтактныйТелефон = "+7 (495) 797-33-33"; // Пример телефона
        ИначеЕсли Объект.Родитель.Наименование = "РКЗ" Тогда
            Объект.Адрес = "Корпус 1, этаж 3, ул. Новозаводская, д. 18";
            Объект.ТипПомещения = Перечисления.ТипПомещения.Режимное;
            Объект.КонтактныйТелефон = "8-495-123-45-68";
        ИначеЕсли Объект.Родитель.Наименование = "КБ Салют" Тогда
            Объект.Адрес = "Корпус 3, этаж 1, ул. Новозаводская, д. 18";
            Объект.ТипПомещения = Перечисления.ТипПомещения.Режимное;
            Объект.КонтактныйТелефон = "8-495-234-56-79";
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
